#不可变，只有查询，不能增删改内部元素
# 定义元组
t = (10,20,30,40)

# 查询
print(t[0])
print(t[-1])

"""
切片：取下标1~3（不含3）
[起始位置]：[终点位置]：[步长]
起始位置：不填默认 0
终点位置:不填默认最后
步长:默认 1，正数从前往后切，负数的话就是从后往前切
"""
print(t[1:3])
print('从后往前切',t[::-1])
print(t.index(20))
print(20 in t)
print(t.count(10))
print(len(t))

# del t  # 删除整个元组，删除后变量t不存在
"""
元组保护的是【容器引用不变】，不是里面嵌套对象
不可变：不能修改里面元素。`t[0]=99` → 直接报错！
特殊坑：元组里面如果嵌套list，列表内部是可以修改的！
"""
t = (10, [20,30], 40)
t[1].append(99) # ✅可以！里面的list是可变对象
print(t) # (10, [20, 30, 99], 40)

#3.只有1个元素的元组，后面必须加逗号：
t1 = (10,)   # 这是元组
t2 = (10)    # 这只是数字10，不是元组！

#4.元组可以和 list 互相转换
t = (1,2,3)
lst = list(t)  # 元组转列表，变成可变
t2 = tuple(lst)# 列表转回元组

#5.id查看元组地址
t = (10, [20,30], 40)
print(id(t[0]))
print(id(t[1]))