"""
集合是可变类型
集合的特点:
1.支持容纳多个元素
2.支持for循环遍历
3.支持修改操作
4.只能存储不可变类型数据:整数,浮点数,布尔值,字符串,元组
5.没有下标索引->不支持while循环
6.没有下标索引->无序(自带去重功能)
7.没有下标索引->不重复
"""
#定义一个空集合
s = set()
print(s) # {1,2,3} 自动去重

# 1.增
# 	集合名.add(元素): 把指定元素追加到对应集合中
s.add(1)
s.add(2)
s.add(2)
s.add(3)
s.add(5)
print('增加元素之后的集合',s)

# 修改为和集合{'5','6'}的并集
s.update([5,6])
print('Update 之后的并集',s)

# 2.改
# 修改为和集合{'4','7'}的差集
s.difference_update({'5','6'})
print('差集',s)

#s.remove(99)  # 报错
s.discard(99)   # 无任何反应
print('删除某个元素之后的集合',s)

s1 = {1,2,3}
s2 = {3,4,5}
print(s1 & s2) #交集 {3}
print(s1 | s2) #并集 {1,2,3,4,5}
print(s1 - s2) #差集 {1,2}

#pop()随机删掉集合中的一个元素，并且把删掉的元素返回给你
s = {1,2,3}
res = s.pop()
print('随机删除的元素',res)
print('随机删除一个元素之后的集合',s)

# for循环方式
# 核心思想: 依次从集合中取出每个元素赋值给临时变量
for num in s:
    print(num)