"""
定义空字典:  字典名 = {}  和  字典名 = dict()
定义非空字典: 字典名 = {k1:v1 , k2:v2 , k3:v3 ...}
注意: 键key:只能是不可变类型且不能重复  值value可以是任意类型且可以重复
"""
"""
字典是可变类型
字典的特点:
1.支持容纳多个元素
2.支持for循环遍历
3.支持修改操作
4.每个元素是键值对:key只能是不可变类型,value可以是任意类型数据
5.没有下标索引->不支持while循环
6.没有下标索引->无序
7.没有下标索引->键不能重复
"""

# 定义空字典
d1 = {}
print(d1, type(d1))
d2 = dict()
print(d2, type(d2))
# 定义非空字典
d3 = {"张三": 18, "李四": 28, '王五': 38}
print(d3, type(d3))
# 字典的嵌套
# 注意: key不能重复且不能是可变类型: 列表,集合,字典
# key只能是不可变类型: 整数,浮点数,布尔值,字符串,元组
d4 = {1: d1, 2: d2, 3: d3}
print(d4, type(d4))
# 综合案例:定义字典,存储每个学生的成绩:语文,数学,英语
score_dict = {
    "张三": {'语文': 99, '数学': 88, '英语': 98},
    "李四": {'语文': 89, '数学': 68, '英语': 100},
    "王五": {'语文': 79, '数学': 98, '英语': 99},
}
print(score_dict, type(score_dict))


"""
字典名[key]:  根据指定的键key获取值value
字典名.get(key):  根据指定的键key获取值value
"""
# 需求:定义非空字典,存储学生姓名和年龄
# 如果key重复,不报错,新值替换旧值
info_dict = {"张三": 18, "李四": 28, '王五': 38, '张三': 38}
print(info_dict, type(info_dict))
# 需求: 查询'张三'的年龄
print(info_dict['张三'])
# 需求: 查询'王五'的年龄
print(info_dict['王五'])
print('---------------------------------------------------------')
# 需求:定义字典,存储每个学生的成绩:语文,数学,英语
score_dict = {
    "张三": {'语文': 99, '数学': 88, '英语': 98},
    "李四": {'语文': 89, '数学': 68, '英语': 100},
    "王五": {'语文': 79, '数学': 98, '英语': 99},
}
print(score_dict, type(score_dict))
# 根据键找值: 值 = 字典名[键]
# 需求: 获取张三的所有成绩
print(score_dict['张三'])
# 需求: 获取张三的数学成绩
print(score_dict['张三']['数学'])
# 需求: 获取李四的英语成绩
print(score_dict['李四']['英语'])

#字典的增删改查
"""
增
	字典名[新key] = value : 在字典中添加一个键值对 新key:value
改
	字典名[旧key] = value : 在字典中修改旧key对应的值为value
删
	字典名.pop(key): 根据key删除对应的键值对
	del 字典名[key]: 根据key删除对应的键值对
	字典名.clear(): 清空字典中所有元素
	del 字典名: 删除整个字典
查
	字典名[key]:  根据key获取value
	字典名.get(key):  根据key获取value
    len(字典名): 获取字典中键值对的个数
    字典名.keys(): 获取所有的key
    字典名.values(): 获取所有的values
    字典名.items(): 获取所有的键值对  注意: 每个键值对都单独封装为元组
    
查询    
# 方式1: 直接遍历字典获取key,然后根据key找value
for k in 字典:
	v = 字典[k]
		循环体
	# 方式2: 先获取所有键值对元组,然后对元组拆包分别拿到key和value
for k,v in 字典.items:
	循环体
"""
# 定义非空字典,要求遍历打印格式为: xx分数是yy
score_dict = {'李四': 80, '王五': 99, '赵六': 90, '张三': 100, '田七': 100}
# 方式1.1(推荐): 直接遍历字典(默认获取的键)
for k in score_dict:
    # 根据k获取v
    # v = score_dict[k]
    v = score_dict.get(k)
    # 格式化输出
    print(f"{k}的分数是:{v}")
print('---------------------------')
# 方式1.2(了解): 先获取所有的key,然后遍历依次获取value
for k in score_dict.keys():
    # 根据k获取v
    # v = score_dict[k]
    v = score_dict.get(k)
    # 格式化输出
    print(f"{k}的分数是:{v}")
print('---------------------------')
# 方式2(推荐): 先获取所有的键值对,然后拆包直接拿到k,v
for k, v in score_dict.items():
    # 格式化输出
    print(f"{k}的分数是:{v}")