#1.递归求1-5和
'''
拆解
sum = 1+2+3+4+5

f(5) = f(4)+5
       f(4)=f(3)+4
            f(3)=f(2)+1
                 f(2)=f(1)+1
                      f(1)=1
1. f(1)=1
2. f(2)=1+2=3
3. f(3)=3+3=6
4. f(4)=6+4=10
5. f(5)=10+5=15
总结规律: f(n)=f(n-1)+n
'''
def get_sum(n):
    if n==1:
        return 1
    else:
        return get_sum(n-1)+n

sum1 = get_sum(5)
print('递归算出1~5的和是',sum1)

##需求: 递归求5的阶乘
# todo 先定义递归函数
# 1.明确函数要干什么(参数,返回值)
'''
5!=5*4*3*2*1
4!=4*3*2*1
3!=3*2*1
2!=2*1
1!=1

5!=4!*5
4!=3!*4
3!=2!*3
2!=1!*2
1!=1
f(n) = f(n-1)*n
'''
def jc(n):
    if n == 1:
        return 1
    else:
        return jc(n-1)*n
jc1 = jc(5)
print('递归算法算出5!=',jc1)

'''
# 需求: 假设1对小兔,一个月长成大兔,再过一个月就生一对小兔...假设没有死亡,一年后有多少对?
"""
1月: 1对
2月: 1对
3月: 2对
4月: 3对
5月: 5对
...
12月: ?对
1、1、2、3、5、8、13
规律：第n个月兔子对数 = 第 n-1 个月兔子对数 + 第 n-2 个月兔子对数

f(1)=1
f(2)=1
f(3) = 2

f(4)=f(3)+f(2)
f(5)=f(4)+f(3)
f(n) = f(n-1)+f(n-2)
"""
'''
def sum2 (n):
    if n == 1 or n==2:
        return 1
    else:
        return sum2(n-1)+sum2(n-2)
print('12月后总共兔子总数:',sum2(12))